BpelSOAP/bpelContent/Places.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Places/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.wscomposition.org/Places/" name="Places">
    <types />
    <message name="PlacesRequest">
        <part name="location" type="xsd:string" />
        <part name="radius" type="xsd:int" />
        <part name="types" type="xsd:string" />
    </message>
    <message name="PlacesRequestResponse">
        <part name="PlacesResponse" type="xsd:string" />
    </message>
    <portType name="Places">
        <operation name="PlacesRequest" parameterOrder="location radius types">
            <input wsam:Action="http://www.wscomposition.org/Places/Places/PlacesRequestRequest" message="tns:PlacesRequest" />
            <output wsam:Action="http://www.wscomposition.org/Places/Places/PlacesRequestResponse" message="tns:PlacesRequestResponse" />
        </operation>
    </portType>
    <binding name="PlacesSOAPBinding" type="tns:Places">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
        <operation name="PlacesRequest">
            <soap:operation soapAction="" />
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Places/" />
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Places/" />
            </output>
        </operation>
    </binding>
    <service name="Places">
        <port name="PlacesSOAP" binding="tns:PlacesSOAPBinding">
            <soap:address location="http://localhost:9001/soapwrapper/Places" />
        </port>
    </service>
</definitions>