mule-esb-soap/target/classes/requests/PlacesRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:plac="http://www.wscomposition.org/Places/">
   <soapenv:Header/>
   <soapenv:Body>
      <plac:PlacesRequest>
         <location></location>
         <radius></radius>
         <types></types>
      </plac:PlacesRequest>
   </soapenv:Body>
</soapenv:Envelope>